Revit 2027 API
ElectricalSetting.VoltageTypes Property
 Get all voltage type definitions information of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VoltageTypeSet VoltageTypes { get; }
Public ReadOnly Property VoltageTypes As VoltageTypeSet
	Get
public:
property VoltageTypeSet^ VoltageTypes {
	VoltageTypeSet^ get ();
}
member VoltageTypes : VoltageTypeSet with get
Property Value
VoltageTypeSet
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace